#pragma once

enum class ItemType {
  None,
  Soda,       // Р“Р°Р·РёСЂРѕРІРєР° вЂ“ РІС‹Р±СЂРѕСЃРёС‚СЊ С‚РµРєСѓС‰РёР№ С€Р°СЂРёРє
  Saw,        // Р СѓС‡РЅР°СЏ РїРёР»Р° вЂ“ СѓРґРІРѕРёС‚СЊ СѓСЂРѕРЅ СЃР»РµРґСѓСЋС‰РµРіРѕ РІС‹СЃС‚СЂРµР»Р°
  Handcuffs,  // РќР°СЂСѓС‡РЅРёРєРё вЂ“ РїСЂРѕС‚РёРІРЅРёРє РїСЂРѕРїСѓСЃРєР°РµС‚ СЃР»РµРґСѓСЋС‰РёР№ С…РѕРґ
  Magnifier,  // Р›СѓРїР° вЂ“ РїРѕРєР°Р·Р°С‚СЊ С‚РёРї С‚РµРєСѓС‰РµРіРѕ С€Р°СЂРёРєР°
  Apple       // РЇР±Р»РѕРєРѕ вЂ“ РІРѕСЃСЃС‚Р°РЅРѕРІРёС‚СЊ 1 Р·РґРѕСЂРѕРІСЊРµ
};

struct Item {
  ItemType type;
  // РњРѕР¶РЅРѕ РґРѕР±Р°РІРёС‚СЊ РґРѕРїРѕР»РЅРёС‚РµР»СЊРЅС‹Рµ РїРѕР»СЏ, РµСЃР»Рё РЅСѓР¶РЅРѕ
};